## **Handling Categorical Features**

## ***One Hot Encoding***

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('titanic.csv',usecols=['Sex'])

In [3]:
data.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [4]:
pd.get_dummies(data).head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

Here our one feature can represent both the categories so we can drop one feature

In [5]:
pd.get_dummies(data,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

Here 1 represent it's male and 0 represents it's female

In [6]:
data = pd.read_csv('titanic.csv',usecols=['Embarked'])

In [7]:
data.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [8]:
data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [10]:
data.dropna(inplace=True)

In [11]:
pd.get_dummies(data,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1